test/wetest/wsman/Get/Get_Success01rspgood.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xml="http://www.w3.org/XML/1998/namespace" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:wsmb="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl" xmlns:wscim="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2">
<SOAP-ENV:Header>
<wsa:To>
http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
</wsa:To>
<wsa:Action>
http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse
</wsa:Action>
<wsa:MessageID>
uuid:00000000-0000-0000-0000-000000000000
</wsa:MessageID>
<wsa:RelatesTo>
uuid:00000000-0000-0000-0004-000000000001
</wsa:RelatesTo>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<class:PG_TestPropertyTypes xmlns:class="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/PG_TestPropertyTypes">
<class:CreationClassName>
PG_TestPropertyTypes
</class:CreationClassName>
<class:InstanceId>
1
</class:InstanceId>
<class:PropertyBoolean>
true
</class:PropertyBoolean>
<class:PropertyDatetime>
P20010515DT10H43M54S
</class:PropertyDatetime>
<class:PropertyReal32>
1.1234567165374756e+00
</class:PropertyReal32>
<class:PropertyReal64>
1.1234567890654321e+00
</class:PropertyReal64>
<class:PropertySint16>
-1600
</class:PropertySint16>
<class:PropertySint32>
-3200
</class:PropertySint32>
<class:PropertySint64>
-6400
</class:PropertySint64>
<class:PropertySint8>
-120
</class:PropertySint8>
<class:PropertyString>
PG_TestPropertyTypes_Instance1
</class:PropertyString>
<class:PropertyUint16>
1600
</class:PropertyUint16>
<class:PropertyUint32>
3200
</class:PropertyUint32>
<class:PropertyUint64>
6400
</class:PropertyUint64>
<class:PropertyUint8>
120
</class:PropertyUint8>
</class:PG_TestPropertyTypes>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
